# Update OSX basics
#brew "coreutils"
brew "findutils", args: ["with-default-names"]
brew "bash"
brew "homebrew/dupes/grep"

# Utilities
brew "moreutils"
brew "jq"
brew "ack"
brew "cheat"
brew "tmux"
brew "gnupg"
brew "bash-completion"
brew "mackup"

# Networking
brew "curl"
brew "git"
brew "wget"
brew "ngrok"
brew "nmap"
brew "wireshark", args: ["devel"]

# Cask/Apps
tap "caskroom/cask"
brew "brew-cask"
tap "caskroom/versions"
cask "google-chrome"
cask "google-hangouts"
cask "iterm2"
cask "sublime-text3"
cask "dropbox"
cask "spotify"
cask "shiftit"
cask "tunnelblick"
cask "skype"
tap "caskroom/fonts"

# Programming
brew "hub"
brew "protobuf"
brew "node"
brew "python"
brew "elixir"
brew "rbenv"
brew "ruby-build"
brew "go"

# Ops tools
brew "packer"
brew "ansible"
brew "terraform"
brew "boot2docker"
brew "docker-compose"
