# Update OSX basics
brew "coreutils"
brew "findutils", args: ["with-default-names"]
brew "bash"
brew "homebrew/dupes/grep"
cask "flux"

# Utilities
brew "moreutils"
brew "jq"
brew "ack"
brew "tmux"
brew "reattach-to-user-namespace"
brew "gnupg"
brew "bash-completion"
brew "mackup"
brew "socat"
brew "htop"

# Networking
brew "curl"
brew "git"
brew "wget"
brew "nmap"
#brew "wireshark", args: ["devel"]

# Cask/Apps
cask "google-chrome"
cask "google-hangouts"
cask "iterm2"
cask "dropbox"
cask "spotify"
cask "lastpass"
cask "vlc"
cask "emacs"
cask "firefox"
cask "flash-ppapi"
cask "unity-web-player"

# Mail
brew "w3m"
brew "offlineimap"
brew "notmuch"
brew "sqlite"
brew "msmtp"

# Fonts
cask "font-inconsolata"

# Programming
brew "hub"
brew "protobuf"
brew "node"
brew "python"
brew "elixir"
brew "rbenv"
brew "ruby-build"
brew "go"
cask "docker"
brew "arcanist"

# Ops tools
brew "packer"
brew "terraform"
cask "virtualbox"
cask "google-cloud-sdk"

# Security
brew "gnupg2"
cask "little-snitch"
brew "aircrack-ng"
cask "keybase"
brew "yubikey-personalization"
cask "yubico-authenticator"
cask "ivpn"
cask "tunnelblick"
