# Update OSX basics
#brew "coreutils"
brew "findutils", args: ["with-default-names"]
brew "bash"
brew "homebrew/dupes/grep"

# Utilities
brew "moreutils"
brew "jq"
brew "ack"
brew "cheat"
brew "tmux"
brew "reattach-to-user-namespace"
brew "gnupg"
brew "bash-completion"
brew "mackup"
brew "socat"
brew "htop"

# Networking
brew "curl"
brew "git"
brew "wget"
brew "homebrew/binary/ngrok2"
brew "nmap"
brew "wireshark", args: ["devel"]

# Cask/Apps
tap "caskroom/cask"
brew "brew-cask"
tap "caskroom/versions"
cask "google-chrome"
cask "google-hangouts"
cask "iterm2"
cask "dropbox"
cask "spotify"
cask "shiftit"
cask "skype"
cask "lastpass"
cask "vlc"
cask "emacs"
cask "firefox"
cask "flash"
flash "unity-web-player"
brew "w3m"

# Fonts
tap "caskroom/fonts"
cask "font-inconsolata"

# Programming
brew "hub"
brew "protobuf"
brew "node"
brew "python"
brew "elixir"
brew "rbenv"
brew "ruby-build"
brew "go"

# Ops tools
brew "packer"
brew "ansible"
brew "terraform"
cask "virtualbox"

# Security
cask "little-snitch"
brew "aircrack-ng"
